_site/boj-2638/index.html
<div id="outline-container-org61d1f93" class="outline-2">
<h2 id="org61d1f93">BOJ 2638 치즈</h2>
<div class="outline-text-2" id="text-org61d1f93">
<ul class="org-ul">
<li>바깥 공기와 안쪽 공기로 나뉨</li>
<li>바깥 공기 2개 이상 인접하면, 치즈를 없앰</li>
</ul>
</div>
</div>

<div id="outline-container-orgf518732" class="outline-2">
<h2 id="orgf518732">접근하기</h2>
<div class="outline-text-2" id="text-orgf518732">
<pre class="example">
1. 바깥을 0 -&gt; 3으로 처음에 변경
2. 1을 만나면 2개의 3이 있는지 check하고 vector에 저장
</pre>
</div>
</div>

<div id="outline-container-orgca5dc58" class="outline-2">
<h2 id="orgca5dc58">코드 - 606 m/s - 느린 구현</h2>
<div class="outline-text-2" id="text-orgca5dc58">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[101][101];

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dy</span>[4] = {1, -1, 0, 0};
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dx</span>[4] = {0, 0, 1, -1};

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">safe</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (0&lt;=y &amp;&amp; y&lt;N) &amp;&amp; (0&lt;=x &amp;&amp; x&lt;M);
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">fill_outside</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span>)
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">visited</span>[101][101] = {0, };
    <span style="color: #8ae234; font-weight: bold;">queue</span>&lt;<span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">q</span>;
    q.push({y,x});
    visited[y][x] = 1;    
    a[y][x] = 2;
    <span style="color: #729fcf; font-weight: bold;">while</span>(!q.empty()) {
        <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">cur</span> = q.front(); q.pop();
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;4;i++) {
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ny</span> = cur.y + dy[i];
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">nx</span> = cur.x + dx[i];

            <span style="color: #729fcf; font-weight: bold;">if</span> (safe(ny, nx) &amp;&amp; visited[ny][nx] == 0 &amp;&amp; a[ny][nx] == 0) {
                visited[ny][nx] = 1;
                a[ny][nx] = 2; 
                q.push({ny, nx});
            }
        }
    }
}

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">touch_two</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span>)
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">visited</span>[101][101] = {0, };

    visited[y][x] = 1;

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cnt</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;4;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ny</span> = y + dy[i];
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">nx</span> = x + dx[i];

        <span style="color: #729fcf; font-weight: bold;">if</span> (safe(ny, nx) &amp;&amp; visited[ny][nx] == 0 &amp;&amp; a[ny][nx] == 2) {
            visited[ny][nx] = 1;
            cnt += 1;                
        }
    }

    <span style="color: #729fcf; font-weight: bold;">return</span> (cnt &gt;= 2);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;M);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">total</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=0;j&lt;M;j++) {
            scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;a[i][j]);
            <span style="color: #729fcf; font-weight: bold;">if</span> (a[i][j]) total += 1;
        }
    }
    fill_outside(0, 0);
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">time</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">while</span>(total) {

        <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">v</span>;
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
            <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=0;j&lt;M;j++) {
                <span style="color: #729fcf; font-weight: bold;">if</span> (a[i][j] == 1) {
                    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ret</span> = touch_two(i, j);
                    <span style="color: #729fcf; font-weight: bold;">if</span> (ret) v.push_back({i,j});
                }
            }
        }

        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span> <span style="color: #ff6347;">o</span>:v) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (a[o.y][o.x] == 1) {
                a[o.y][o.x] = 2;
                fill_outside(o.y, o.x);
                total--;
            } 
        }

        time += 1;    
        dbg();
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, time);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org49bfea5" class="outline-2">
<h2 id="org49bfea5"><span class="todo TODO">TODO</span> 코드 - 시간 최적화 할 것</h2>
</div>

<div id="outline-container-org5a3ba10" class="outline-2">
<h2 id="org5a3ba10">문제 링크</h2>
<div class="outline-text-2" id="text-org5a3ba10">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/2638">https://www.acmicpc.net/problem/2638</a></li>
</ul>
</div>
</div>
